<?xml version="1.0" ?>
<net name="elg_onnx_tf2onnx_bilinear_ir" version="10">
	<layers>
		<layer id="0" name="input_1:0" type="Parameter" version="opset1">
			<data element_type="f16" shape="2,108,180,1"/>
			<output>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>108</dim>
					<dim>180</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="hourglass_pre/BiasAdd__6/Cast_140519_const" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="hourglass_pre/BiasAdd__6" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>108</dim>
					<dim>180</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>1</dim>
					<dim>108</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="hourglass_pre/BiasAdd_weights_fused_bn/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="32" shape="64,1,7,7" size="6272"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="hourglass_pre/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="2,2" pads_end="2,2" strides="3,3"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>108</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="hourglass_pre/BiasAdd/Dims1007718545/EltwiseUnsqueeze18989_const" type="Const" version="opset1">
			<data element_type="f16" offset="6304" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="hourglass_pre/BiasAdd" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="activation_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="data_mul_1788618666/EltwiseUnsqueeze19329_const" type="Const" version="opset1">
			<data element_type="f16" offset="6432" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="hourglass_pre_res1_conv1_BatchNorm/FusedBatchNormV3/mean/Fused_Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="data_add_1788818667/EltwiseUnsqueeze19333_const" type="Const" version="opset1">
			<data element_type="f16" offset="6560" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="hourglass_pre_res1_conv1_BatchNorm/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="activation_2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="hourglass_pre_res1_conv1/BiasAdd_weights_fused_bn/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="6688" shape="64,64,1,1" size="8192"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="hourglass_pre_res1_conv1/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="hourglass_pre_res1_conv1/BiasAdd/Dims982518503/EltwiseUnsqueeze18821_const" type="Const" version="opset1">
			<data element_type="f16" offset="14880" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="hourglass_pre_res1_conv1/BiasAdd" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="activation_3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="hourglass_pre_res1_conv2/BiasAdd_weights_fused_bn/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="15008" shape="64,64,3,3" size="73728"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="hourglass_pre_res1_conv2/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="hourglass_pre_res1_conv2/BiasAdd/Dims1052118619/EltwiseUnsqueeze19285_const" type="Const" version="opset1">
			<data element_type="f16" offset="88736" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="hourglass_pre_res1_conv2/BiasAdd" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="activation_4/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="hourglass_pre_res1_conv3/Conv2D/ReadVariableOp:0/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="88864" shape="128,64,1,1" size="16384"/>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="hourglass_pre_res1_conv3/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>128</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="hourglass_pre_res1_conv3/BiasAdd/Dims1005918542/EltwiseUnsqueeze18977_const" type="Const" version="opset1">
			<data element_type="f16" offset="105248" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="hourglass_pre_res1_conv3/BiasAdd" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>128</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>128</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="hourglass_pre_res1_skip/Conv2D/ReadVariableOp:0/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="105504" shape="128,64,1,1" size="16384"/>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="hourglass_pre_res1_skip/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>128</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="hourglass_pre_res1_skip/BiasAdd/Dims1000518533/EltwiseUnsqueeze18941_const" type="Const" version="opset1">
			<data element_type="f16" offset="105248" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="hourglass_pre_res1_skip/BiasAdd" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>128</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>128</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="add_1/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>128</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>2</dim>
					<dim>128</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>128</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="data_mul_178901789418668/EltwiseUnsqueeze19337_const" type="Const" version="opset1">
			<data element_type="f16" offset="121888" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="hourglass_pre_res2_conv1_BatchNorm/FusedBatchNormV3/mean/Fused_Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>128</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>128</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="data_add_178911789618669/EltwiseUnsqueeze19341_const" type="Const" version="opset1">
			<data element_type="f16" offset="122144" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="hourglass_pre_res2_conv1_BatchNorm/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>128</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>128</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="activation_5/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>128</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>2</dim>
					<dim>128</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="hourglass_pre_res2_conv1/BiasAdd_weights_fused_bn/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="122400" shape="32,128,1,1" size="8192"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="hourglass_pre_res2_conv1/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>128</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="hourglass_pre_res2_conv1/BiasAdd/Dims1032918587/EltwiseUnsqueeze19157_const" type="Const" version="opset1">
			<data element_type="f16" offset="130592" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="hourglass_pre_res2_conv1/BiasAdd" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="activation_6/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>2</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="hourglass_pre_res2_conv2/BiasAdd_weights_fused_bn/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="130656" shape="32,32,3,3" size="18432"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="hourglass_pre_res2_conv2/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="hourglass_pre_res2_conv2/BiasAdd/Dims1040718600/EltwiseUnsqueeze19209_const" type="Const" version="opset1">
			<data element_type="f16" offset="149088" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="hourglass_pre_res2_conv2/BiasAdd" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="activation_7/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>2</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="hourglass_pre_res2_conv3/Conv2D/ReadVariableOp:0/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="149152" shape="64,32,1,1" size="4096"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="hourglass_pre_res2_conv3/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="hourglass_pre_res2_conv3/BiasAdd/Dims1008318546/EltwiseUnsqueeze18993_const" type="Const" version="opset1">
			<data element_type="f16" offset="153248" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="hourglass_pre_res2_conv3/BiasAdd" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="hourglass_pre_res2_skip/Conv2D/ReadVariableOp:0/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="153376" shape="64,128,1,1" size="16384"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="hourglass_pre_res2_skip/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>128</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="hourglass_pre_res2_skip/BiasAdd/Dims1027518578/EltwiseUnsqueeze19121_const" type="Const" version="opset1">
			<data element_type="f16" offset="153248" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="hourglass_pre_res2_skip/BiasAdd" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="add_2/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="data_mul_178981790218670/EltwiseUnsqueeze19345_const" type="Const" version="opset1">
			<data element_type="f16" offset="169760" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="hourglass_hg_1_depth1_up1_1_conv1_BatchNorm/FusedBatchNormV3/mean/Fused_Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="data_add_178991790418671/EltwiseUnsqueeze19349_const" type="Const" version="opset1">
			<data element_type="f16" offset="169888" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="hourglass_hg_1_depth1_up1_1_conv1_BatchNorm/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="activation_8/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="hourglass_hg_1_depth1_up1_1_conv1/BiasAdd_weights_fused_bn/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="170016" shape="32,64,1,1" size="4096"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="hourglass_hg_1_depth1_up1_1_conv1/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="hourglass_hg_1_depth1_up1_1_conv1/BiasAdd/Dims1017918562/EltwiseUnsqueeze19057_const" type="Const" version="opset1">
			<data element_type="f16" offset="174112" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="hourglass_hg_1_depth1_up1_1_conv1/BiasAdd" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="activation_9/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>2</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="hourglass_hg_1_depth1_up1_1_conv2/BiasAdd_weights_fused_bn/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="174176" shape="32,32,3,3" size="18432"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="hourglass_hg_1_depth1_up1_1_conv2/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="hourglass_hg_1_depth1_up1_1_conv2/BiasAdd/Dims992118519/EltwiseUnsqueeze18885_const" type="Const" version="opset1">
			<data element_type="f16" offset="192608" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="hourglass_hg_1_depth1_up1_1_conv2/BiasAdd" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="activation_10/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>2</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="hourglass_hg_1_depth1_up1_1_conv3/Conv2D/ReadVariableOp:0/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="192672" shape="64,32,1,1" size="4096"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="hourglass_hg_1_depth1_up1_1_conv3/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="hourglass_hg_1_depth1_up1_1_conv3/BiasAdd/Dims1047918612/EltwiseUnsqueeze19257_const" type="Const" version="opset1">
			<data element_type="f16" offset="196768" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="hourglass_hg_1_depth1_up1_1_conv3/BiasAdd" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="add_3/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="max_pooling2d_1/MaxPool" type="MaxPool" version="opset1">
			<data kernel="2,2" pads_begin="0,0" pads_end="0,0" rounding_type="floor" strides="2,2"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="data_mul_179061791018672/EltwiseUnsqueeze19353_const" type="Const" version="opset1">
			<data element_type="f16" offset="196896" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="hourglass_hg_1_depth1_low1_1_conv1_BatchNorm/FusedBatchNormV3/mean/Fused_Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="data_add_179071791218673/EltwiseUnsqueeze19357_const" type="Const" version="opset1">
			<data element_type="f16" offset="197024" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="hourglass_hg_1_depth1_low1_1_conv1_BatchNorm/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="activation_11/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="hourglass_hg_1_depth1_low1_1_conv1/BiasAdd_weights_fused_bn/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="197152" shape="32,64,1,1" size="4096"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="hourglass_hg_1_depth1_low1_1_conv1/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>32</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="hourglass_hg_1_depth1_low1_1_conv1/BiasAdd/Dims977118494/EltwiseUnsqueeze18785_const" type="Const" version="opset1">
			<data element_type="f16" offset="201248" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="hourglass_hg_1_depth1_low1_1_conv1/BiasAdd" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>32</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>32</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="activation_12/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>32</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>2</dim>
					<dim>32</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="hourglass_hg_1_depth1_low1_1_conv2/BiasAdd_weights_fused_bn/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="201312" shape="32,32,3,3" size="18432"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="hourglass_hg_1_depth1_low1_1_conv2/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>32</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>32</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="hourglass_hg_1_depth1_low1_1_conv2/BiasAdd/Dims1014918557/EltwiseUnsqueeze19037_const" type="Const" version="opset1">
			<data element_type="f16" offset="219744" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="hourglass_hg_1_depth1_low1_1_conv2/BiasAdd" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>32</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>32</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="activation_13/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>32</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>2</dim>
					<dim>32</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="hourglass_hg_1_depth1_low1_1_conv3/Conv2D/ReadVariableOp:0/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="219808" shape="64,32,1,1" size="4096"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="hourglass_hg_1_depth1_low1_1_conv3/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>32</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="hourglass_hg_1_depth1_low1_1_conv3/BiasAdd/Dims1034118589/EltwiseUnsqueeze19165_const" type="Const" version="opset1">
			<data element_type="f16" offset="223904" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="hourglass_hg_1_depth1_low1_1_conv3/BiasAdd" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="add_4/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>2</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="data_mul_179141791818674/EltwiseUnsqueeze19361_const" type="Const" version="opset1">
			<data element_type="f16" offset="224032" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="hourglass_hg_1_depth1_depth2_up1_1_conv1_BatchNorm/FusedBatchNormV3/mean/Fused_Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="data_add_179151792018675/EltwiseUnsqueeze19365_const" type="Const" version="opset1">
			<data element_type="f16" offset="224160" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="hourglass_hg_1_depth1_depth2_up1_1_conv1_BatchNorm/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="activation_14/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="hourglass_hg_1_depth1_depth2_up1_1_conv1/BiasAdd_weights_fused_bn/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="224288" shape="32,64,1,1" size="4096"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="hourglass_hg_1_depth1_depth2_up1_1_conv1/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>32</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="hourglass_hg_1_depth1_depth2_up1_1_conv1/BiasAdd/Dims989118514/EltwiseUnsqueeze18865_const" type="Const" version="opset1">
			<data element_type="f16" offset="228384" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="hourglass_hg_1_depth1_depth2_up1_1_conv1/BiasAdd" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>32</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>32</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="activation_15/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>32</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>2</dim>
					<dim>32</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="hourglass_hg_1_depth1_depth2_up1_1_conv2/BiasAdd_weights_fused_bn/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="228448" shape="32,32,3,3" size="18432"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="hourglass_hg_1_depth1_depth2_up1_1_conv2/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>32</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>32</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="hourglass_hg_1_depth1_depth2_up1_1_conv2/BiasAdd/Dims973518488/EltwiseUnsqueeze18761_const" type="Const" version="opset1">
			<data element_type="f16" offset="246880" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="hourglass_hg_1_depth1_depth2_up1_1_conv2/BiasAdd" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>32</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>32</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="activation_16/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>32</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>2</dim>
					<dim>32</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="hourglass_hg_1_depth1_depth2_up1_1_conv3/Conv2D/ReadVariableOp:0/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="246944" shape="64,32,1,1" size="4096"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="hourglass_hg_1_depth1_depth2_up1_1_conv3/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>32</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="hourglass_hg_1_depth1_depth2_up1_1_conv3/BiasAdd/Dims1022718570/EltwiseUnsqueeze19089_const" type="Const" version="opset1">
			<data element_type="f16" offset="251040" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="hourglass_hg_1_depth1_depth2_up1_1_conv3/BiasAdd" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>1</dim>
